"""
2.2 Строки: индексы и срезы
2 из 13 шагов пройдено
1 из 20 баллов  получен
Программа получает на вход строку и ваша
задача вывести первый элемент данной строки

Sample Input 1:

Zemfira
Sample Output 1:

Z
Sample Input 2:

It
Sample Output 2:

I
"""

a = input()
print(a[0])



