"""
2.2 Строки: индексы и срезы
5 из 13 шагов пройдено
4 из 20 баллов  получено
Программа получает на вход строку и ваша задача вывести последний символ этой строки

Sample Input 1:

Сплин
Sample Output 1:

н
Sample Input 2:

Billie Eilish
Sample Output 2:

h
"""

a = input()
print(a[-1])
