"""
5.6 Вложенные списки
11 из 16 шагов пройдено
53 из 87 баллов  получено
Состязания - 3

В метании молота состязается n спортcменов. Каждый из них сделал m бросков. Побеждает спортсмен, у которого
максимален наилучший бросок. Если таких несколько, то из них побеждает тот, у которого наилучшая сумма результатов по
всем попыткам. Если и таких несколько, победителем считается спортсмен с минимальным номером. Определите номер
победителя соревнований.

Входные данные

Программа получает на вход два числа n и m, являющиеся числом строк и столбцов в массиве. Далее во входном потоке
идет n строк по m чисел, являющихся элементами массива.

Выходные данные

Программа должна вывести одно число - номер победителя соревнований. Не забудьте, что  строки  (спортсмены)
нумеруются с 0.

Решение задачи Youtube Patreon Boosty

Sample Input:

3 3
1 2 7
1 3 5
4 1 6
Sample Output:

0
"""