n = int(input())
i = 0
while i**2 <= n:
    if i ** 2 > 0:
        print(i**2)
    i += 1

"""Выведите все точные квадраты натуральных чисел, не превосходящие данного числа N.

Задано единственное целое число N

Необходимо вывести  все точные квадраты натуральных чисел, не превосходящие данного числа N.

Sample Input:

15
Sample Output:

1
4
9
"""
